veryneo/stm32_cmake_project/app/app_demo/src/app_demo.c
#include "app_demo.h"

#include "bsp.h"

#include "stdio.h"

#include "lib_NDEF_AAR.h"
#include "lib_NDEF_URI.h"
#include "tagtype5_wrapper.h"

#include "stm32_wpan_common.h"
#include "tl.h"
#include "shci.h"
#include "shci_tl.h"
#include "hci_tl.h"
#include "ble_defs.h"
#include "ble_types.h"
#include "ble_gap_aci.h"
#include "ble_gatt_aci.h"
#include "ble_vs_codes.h"
#include "ble_legacy.h"
#include "ble_std.h"
#include "ble_hci_le.h"
#include "ble_hal_aci.h"
#include "svc_ctl.h"
#include "app_conf.h"
#include "otp.h"

#define PLACE_IN_SECTION( __x__ )                               __attribute__((section (__x__)))
#define ALIGN(n)                                                __attribute__((aligned(n)))

#define CFG_TLBLE_MOST_EVENT_PAYLOAD_SIZE 255   /**< Set to 255 with the memory manager and the mailbox */

#define TL_BLE_EVENT_FRAME_SIZE ( TL_EVT_HDR_SIZE + CFG_TLBLE_MOST_EVENT_PAYLOAD_SIZE )

#define D_APP_DEMO_TL_MM_BLE_EVT_QUEUE_LEN                      (5)
#define D_APP_DEMO_TL_MM_POOL_SIZE                              (D_APP_DEMO_TL_MM_BLE_EVT_QUEUE_LEN*4U*DIVC((sizeof(TL_PacketHeader_t) + TL_BLE_EVENT_FRAME_SIZE ), 4U))
#define D_APP_DEMO_BLE_BDADDR_SIZE                              (6)
#define D_APP_DEMO_BLE_GAP_DEVICE_NAME_LEN                      (sizeof(gs_app_demo_ble_gap_device_name))

#define D_APP_DEMO_BLE_CUSTOM_SERVICE_UUID                      (0xFE40)
#define D_APP_DEMO_BLE_CUSTOM_WRITE_CHAR_UUID                   (0xFE41)
#define D_APP_DEMO_BLE_CUSTOM_NOTIFY_CHARA_UUID                 (0xFE42)

#define D_APP_DEMO_COPY_BLE_CUSTOM_SERVICE_UUID(uuid)           COPY_UUID_128(uuid,0x00,0x00,0xfe,0x40,0xcc,0x7a,0x48,0x2a,0x98,0x4a,0x7f,0x2e,0xd5,0xb3,0xe5,0x8f)
#define D_APP_DEMO_COPY_BLE_CUSTOM_WRITE_CHAR_UUID(uuid)        COPY_UUID_128(uuid,0x00,0x00,0xfe,0x41,0x8e,0x22,0x45,0x41,0x9d,0x4c,0x21,0xed,0xae,0x82,0xed,0x19)
#define D_APP_DEMO_COPY_BLE_CUSTOM_NOTIFY_CHAR_UUID(uuid)       COPY_UUID_128(uuid,0x00,0x00,0xfe,0x42,0x8e,0x22,0x45,0x41,0x9d,0x4c,0x21,0xed,0xae,0x82,0xed,0x19)

#define D_APP_DEMO_BLE_CUSTOM_SERVICE_MAX_ATT_RECORDS           (8)
#define D_APP_DEMO_BLE_CUSTOM_SERVICE_WRTIE_CHAR_VALUE_LEN      (2)
#define D_APP_DEMO_BLE_CUSTOM_SERVICE_NOTIFY_CHAR_VALUE_LEN     (2)
#define D_APP_DEMO_BLE_CUSTOM_SERVICE_CHAR_VALUE_ATTR_OFFSET    (1)

#define CFG_ADV_BD_ADDRESS                                      (0x7257acd87a6c)

#define D_APP_DEMO_BLE_FAST_CONN_ADV_INTERVAL_MIN               (0x00C8)  /**< 250ms */
#define D_APP_DEMO_BLE_FAST_CONN_ADV_INTERVAL_MAX               (0x00C8)  /**< 250ms */
#define D_APP_DEMO_BLE_LP_CONN_ADV_INTERVAL_MIN                 (0x0640)  /**< 1s */
#define D_APP_DEMO_BLE_LP_CONN_ADV_INTERVAL_MAX                 (0x0FA0)  /**< 2.5s */

#define COPY_UUID_128(uuid_struct, uuid_15, uuid_14, uuid_13, uuid_12, uuid_11, uuid_10, uuid_9, uuid_8, uuid_7, uuid_6, uuid_5, uuid_4, uuid_3, uuid_2, uuid_1, uuid_0) \
do {\
  uuid_struct[0] = uuid_0; uuid_struct[1] = uuid_1; uuid_struct[2] = uuid_2; uuid_struct[3] = uuid_3; \
    uuid_struct[4] = uuid_4; uuid_struct[5] = uuid_5; uuid_struct[6] = uuid_6; uuid_struct[7] = uuid_7; \
      uuid_struct[8] = uuid_8; uuid_struct[9] = uuid_9; uuid_struct[10] = uuid_10; uuid_struct[11] = uuid_11; \
        uuid_struct[12] = uuid_12; uuid_struct[13] = uuid_13; uuid_struct[14] = uuid_14; uuid_struct[15] = uuid_15; \
}while(0)

#define D_APP_DEMO_NFCTAG_BLE_MAC_ADDR_STR_LEN					(6*2 + 5 + 1) /* 6*2 + 5 + 1. 6表示6个16进制数， 5表示5个冒号，1表示1个结束符号 */


typedef enum 
{
    E_APP_DEMO_CPU2_RUN_STATUS_NONE = 0,
    E_APP_DEMO_CPU2_RUN_STATUS_WIRELESS,
    E_APP_DEMO_CPU2_RUN_STATUS_FUS,
} E_APP_DEMO_CPU2_RUN_STATUS_T;

typedef enum
{
    E_APP_DEMO_SHCI_EVENT_PENDING_FLAG_RESET    =   0,
    E_APP_DEMO_SHCI_EVENT_PENDING_FLAG_SET      =   !E_APP_DEMO_SHCI_EVENT_PENDING_FLAG_RESET,
} E_APP_DEMO_SHCI_EVENT_PENDDING_FLAG_T;

typedef enum
{
    E_APP_DEMO_HCI_EVENT_PENDING_FLAG_RESET    =   0,
    E_APP_DEMO_HCI_EVENT_PENDING_FLAG_SET      =   !E_APP_DEMO_SHCI_EVENT_PENDING_FLAG_RESET,
} E_APP_DEMO_HCI_EVENT_PENDDING_FLAG_T;

typedef enum
{
	E_APP_DEMO_BLE_CONN_FLAG_RESET 				=	0,
	E_APP_DEMO_BLE_CONN_FLAG_SET				=	!E_APP_DEMO_BLE_CONN_FLAG_RESET
} E_APP_DEMO_BLE_CONN_FLAG_T;

typedef enum
{
	E_APP_DEMO_LOWPOWER_ENTER_FLAG_RESET		=	0,
	E_APP_DEMO_LOWPOWER_ENTER_FLAG_SET			=	!E_APP_DEMO_LOWPOWER_ENTER_FLAG_RESET
} E_APP_DEMO_LOWPOWER_ENTER_FLAG_T;

typedef struct
{
    uint16_t service_handle;                        /* Service handle */
    uint16_t write_char_handle;                     /* Characteristic Write handle */
    uint16_t notify_char_handle;                    /* Characteristic Notify handle */
} S_APP_DEMO_BLE_CUSTOM_SERVICE_CTX_T;


PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t         gs_app_demo_tl_mm_evtpool[D_APP_DEMO_TL_MM_POOL_SIZE];
PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static uint8_t         gs_app_demo_tl_mm_system_spare_evt_buf[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t         gs_app_demo_tl_mm_ble_spare_evt_buf[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t  gs_app_demo_shci_tl_cmd_buf;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t  gs_app_demo_hci_tl_cmd_buffer;

static uint8_t bd_address_udn[D_APP_DEMO_BLE_BDADDR_SIZE];

static const uint8_t a_MBdAddr[D_APP_DEMO_BLE_BDADDR_SIZE] =
{
    (uint8_t)((CFG_ADV_BD_ADDRESS & 0x0000000000FF)),
    (uint8_t)((CFG_ADV_BD_ADDRESS & 0x00000000FF00) >> 8),
    (uint8_t)((CFG_ADV_BD_ADDRESS & 0x000000FF0000) >> 16),
    (uint8_t)((CFG_ADV_BD_ADDRESS & 0x0000FF000000) >> 24),
    (uint8_t)((CFG_ADV_BD_ADDRESS & 0x00FF00000000) >> 32),
    (uint8_t)((CFG_ADV_BD_ADDRESS & 0xFF0000000000) >> 40)
};

static const char       gs_app_demo_ble_gap_device_name[]   =   { 'H', 'E', 'L', 'L', 'O', '!' };
static const uint8_t    gs_app_demo_ble_gap_appearance      =   0x00;
static const char       gs_app_demo_ble_ad_local_name[]     = { AD_TYPE_COMPLETE_LOCAL_NAME, 'H', 'E', 'L', 'L', 'O', '!' };
static uint8_t          gs_app_demo_ble_ad_manufacturer_specific_data[14] = { /* Manufacturer specific data used to get compliant with ST BLE Sensor smart phone apk */
                            sizeof(gs_app_demo_ble_ad_manufacturer_specific_data)-1,
                            AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 
                            0x01, /* BlueST Protocol version */
                            0x83, /* BlueST Device Id: 0x83 - P2PServer1 - for more details please see BLE_p2pServer example project */
                            0x00, /* BlueST Feature Mask bits 24~31 */
                            0x00, /* BlueST Feature Mask bits 16~23 */
                            0x00, /* BlueST Feature Mask bits 8~15 */
                            0x00, /* BlueST Feature Mask bits 0~7 */
                            0x00, /* BlueST Device MAC byte 5 */
                            0x00, /* BlueST Device MAC byte 4 */
                            0x00, /* BlueST Device MAC byte 3 */
                            0x00, /* BlueST Device MAC byte 2 */
                            0x00, /* BlueST Device MAC byte 1 */
                            0x00  /* BlueST Device MAC byte 0 */
};

static E_APP_DEMO_CPU2_RUN_STATUS_T             gs_app_demo_cpu2_run_status         =   E_APP_DEMO_CPU2_RUN_STATUS_NONE;
static E_APP_DEMO_SHCI_EVENT_PENDDING_FLAG_T    gs_app_demo_shci_event_pending_flag =   E_APP_DEMO_SHCI_EVENT_PENDING_FLAG_RESET;
static E_APP_DEMO_HCI_EVENT_PENDDING_FLAG_T     gs_app_demo_hci_event_pending_flag  =   E_APP_DEMO_HCI_EVENT_PENDING_FLAG_RESET;
static E_APP_DEMO_BLE_CONN_FLAG_T				gs_app_demo_ble_conn_flag			=	E_APP_DEMO_BLE_CONN_FLAG_RESET;
static E_APP_DEMO_LOWPOWER_ENTER_FLAG_T			ga_app_demo_lowpower_enter_flag		=	E_APP_DEMO_LOWPOWER_ENTER_FLAG_RESET;
static uint8_t gs_app_demo_cpu2_err_flag = 0;

static S_APP_DEMO_BLE_CUSTOM_SERVICE_CTX_T gs_app_demo_ble_custom_service_ctx;

static uint8_t gs_app_demo_nfctag_ble_bd_addr[D_APP_DEMO_NFCTAG_BLE_MAC_ADDR_STR_LEN] = {0};

static uint16_t gs_app_demo_ble_conn_handle = 0;

