veryneo/stm32_cmake_project/app/app_demo/src/app_demo.c
static void app_demo_cpu2_system_init();
static void app_demo_shci_tl_status_notification_callback(SHCI_TL_CmdStatus_t status);
static void app_demo_shci_user_event_received_callback(void* pData);

static void app_demo_ble_init();
static void app_demo_ble_tl_init();
static void app_demo_ble_gap_gatt_init();
static const uint8_t* app_demo_ble_bdaddress_get();
static void app_demo_hci_tl_status_notification_callback(HCI_TL_CmdStatus_t status);
static void app_demo_hci_user_event_receive_callback(void* pData);

static void app_demo_ble_custom_service_init();
// static tBleStatus app_demo_ble_custom_service_char_value_update(uint16_t uuid, uint16_t new_value_len, uint8_t* p_new_value);
static SVCCTL_EvtAckStatus_t app_demo_ble_custom_service_event_handler(void* event);

static void app_demo_ble_advertising_start();
static void app_demo_ble_advertising_stop();
static void app_demo_ble_conn_disconnect();
static void app_demo_ble_stack_reset();

static void app_demo_lowpower_sw_callback();

extern int app_demo()
{
	uint32_t ret = D_BSP_RET_OK;
	uint16_t ndef_ret = NDEF_OK;

	bsp_uart1_init();
	bsp_switch_sw_init();
	bsp_switch_sw3_it_callback_set(app_demo_lowpower_sw_callback);

	bsp_nfc07a1_led_init(E_BSP_NFC07A1_LED_GREEN);
	bsp_nfc07a1_led_init(E_BSP_NFC07A1_LED_YELLOW);
	bsp_nfc07a1_led_init(E_BSP_NFC07A1_LED_BLUE);

//	bsp_nfc07a1_gpo_init();

	printf("\r\n");
	printf("---------------------------------------------\r\n");
	printf("Demo start ~~~\r\n");
	printf("---------------------------------------------\r\n");
	printf("\r\n");

     uint8_t lowpower_standby_flag = 0;
     ret = bsp_lowpower_mode_standby_resume_check(&lowpower_standby_flag);
     if (ret != D_BSP_RET_OK)
     {
         printf("Error of bsp_lowpower_mode_standby_resume_check !!!\r\n");
     }
     else
     {
         if (lowpower_standby_flag == 1)
         {
             printf("System resume from standby mode\r\n");
         }
         else
         {
        	 printf("System restart\r\n");
         }
     }

     bsp_nfc07a1_led_toggle(E_BSP_NFC07A1_LED_GREEN);

     app_demo_cpu2_system_init();

    while (gs_app_demo_cpu2_run_status != E_APP_DEMO_CPU2_RUN_STATUS_WIRELESS)
    {
        if (gs_app_demo_shci_event_pending_flag == E_APP_DEMO_SHCI_EVENT_PENDING_FLAG_SET)
        {
        	gs_app_demo_shci_event_pending_flag = E_APP_DEMO_SHCI_EVENT_PENDING_FLAG_RESET;
            shci_user_evt_proc();

        }
    }

    app_demo_ble_init();

    while (D_BSP_RET_OK != bsp_nfc07a1_nfctag_init() )
    {
        bsp_nfc07a1_led_toggle(E_BSP_NFC07A1_LED_YELLOW);
        bsp_nfc07a1_led_delay_ms(500);
    }

    bsp_nfc07a1_led_off(E_BSP_NFC07A1_LED_YELLOW);

     NfcTag_SelectProtocol(NFCTAG_TYPE5);

     if (NfcType5_NDEFDetection() != NDEF_OK)
     {
         CCFileStruct.MagicNumber    =   NFCT5_MAGICNUMBER_E1_CCFILE;
         CCFileStruct.Version        =   NFCT5_VERSION_V1_0;
         CCFileStruct.MemorySize     =   (ST25DVXXKC_MAX_SIZE / 8) & 0xFF; // 0x200 = 512 (decimal)
         CCFileStruct.TT5Tag         =   0x05;
         /* Init of the Type Tag 5 component (M24LR) */
         while (NfcType5_TT5Init() != NDEF_OK);
     }

     uint16_t ndef_size = 0;
	 ndef_ret = NDEF_getNDEFSize(&ndef_size);
	 if (ndef_ret != NDEF_OK)
	 {
	 	printf("Error of NDEF_getNDEFSize, ret =  %u!!!\r\n", ndef_ret);
	 }
	 if (ndef_size == 0)
	 {
	 	sURI_Info record_info_uri = {0};
	 	strcpy(record_info_uri.URI_Message, (char*)gs_app_demo_nfctag_ble_bd_addr);
	 	strcpy(record_info_uri.Information,"\0" );
	 	ndef_ret = NDEF_WriteURI(&record_info_uri);
	 	if (ndef_ret != NDEF_OK)
	 	{
	 		printf("Error of NDEF_WriteURI !!!\r\n");
	 	}

	 	sAARInfo record_info_aar = {0};
	 	strcpy(record_info_aar.PackageName, "com.fhc.app");
	 	ndef_ret = NDEF_AddAAR(&record_info_aar);
	 	if (ndef_ret != NDEF_OK)
	 	{
	 		printf("Error of NDEF_AddAAR !!!\r\n");
	 	}
	 }

	 uint32_t nfctag_password_msb = 000;
	 uint32_t nfctag_password_lsb = 000;
	 ret = bsp_nfc07a1_nfctag_i2cPassword_present(nfctag_password_msb, nfctag_password_lsb);
	 if (D_BSP_RET_OK != ret)
	 {
	 	printf("Error of bsp_nfc07a1_nfctag_i2cPassword_present !!!\r\n");
	 }

	 ret = bsp_nfc07a1_nfctag_it_configure(D_BSP_NFC07A1_NFCTAG_GPO1_ENABLE_MASK | D_BSP_NFC07A1_NFCTAG_GPO1_FILEDCHQNGE_MASK);
	 if (D_BSP_RET_OK != ret)
	 {
	 	printf("ERROR of bsp_nfc07a1_nfctag_it_configure !!!");
	 }

	 SVCCTL_Init();

	 app_demo_ble_custom_service_init();

    app_demo_ble_advertising_start();

    while(1)
    {
    	if (gs_app_demo_shci_event_pending_flag == E_APP_DEMO_SHCI_EVENT_PENDING_FLAG_SET)
        {
        	gs_app_demo_shci_event_pending_flag = E_APP_DEMO_SHCI_EVENT_PENDING_FLAG_RESET;
            shci_user_evt_proc();
        }

    	if (gs_app_demo_hci_event_pending_flag == E_APP_DEMO_HCI_EVENT_PENDING_FLAG_SET)
    	{
    		gs_app_demo_hci_event_pending_flag = E_APP_DEMO_HCI_EVENT_PENDING_FLAG_RESET;
    		hci_user_evt_proc();
    	}

    	if (gs_app_demo_ble_conn_flag == E_APP_DEMO_BLE_CONN_FLAG_SET)
    	{
    		bsp_nfc07a1_led_on(E_BSP_NFC07A1_LED_BLUE);
    	}

    	if (gs_app_demo_ble_conn_flag == E_APP_DEMO_BLE_CONN_FLAG_RESET)
    	{
    		bsp_nfc07a1_led_off(E_BSP_NFC07A1_LED_BLUE);
    	}

    	if (ga_app_demo_lowpower_enter_flag == E_APP_DEMO_LOWPOWER_ENTER_FLAG_SET)
    	{
    		if (gs_app_demo_ble_conn_flag == E_APP_DEMO_BLE_CONN_FLAG_RESET)
    		{
    			app_demo_ble_advertising_stop();
    		}
    		else
    		{
    			app_demo_ble_conn_disconnect();
    		}

    		app_demo_ble_stack_reset();

    		bsp_lowpower_mode_standby_enter();
    	}
    }




    // bsp_delay(5000);

    // bsp_lowpower_mode_standby_enter();



//	ndef_ret = NDEF_ReadNDEF(ndef_buffer);
//	if (ndef_ret != NDEF_OK)
//	{
//		printf("Error of NDEF_ReadNDEF, ret =  %u!!!\r\n", ndef_ret);
//	}
//
//	ndef_ret = NDEF_IdentifyBuffer(&record_info, ndef_buffer);
//	if (ndef_ret != NDEF_OK)
//	{
//		printf("Error of NDEF_IdentifyBuffer, ret =  %u!!!\r\n", ndef_ret);
//	}


//    printf("Check NFC tag I2C ss status\r\n");
//    E_BSP_NFC07A1_NFCTAG_I2C_SS_STATUS_T i2c_ss_status = E_BSP_NFC07A1_NFCTAG_I2C_SS_STATUS_CLOSED;
//    ret = bsp_nfc07a1_nfctag_i2cSecuritySessionDyn_get(&i2c_ss_status);
//    if (D_BSP_RET_OK != ret)
//    {
//		printf("Error of bsp_nfc07a1_nfctag_i2cSecuritySessionDyn_get !!!\r\n");
//    }
//    else
//    {
//        printf("NFC tag I2C SS status = %u\r\n", i2c_ss_status);
//    }
//
//    printf("\r\n");
//
//    printf("Present wrong password\r\n");
//	uint32_t nfctag_password_msb = 123;
//	uint32_t nfctag_password_lsb = 123;
//	ret = bsp_nfc07a1_nfctag_i2cPassword_present(nfctag_password_msb, nfctag_password_lsb);
//	if (D_BSP_RET_OK != ret)
//	{
//		printf("Error of bsp_nfc07a1_nfctag_i2cPassword_present !!!\r\n");
//	}
//	printf("Check NFC tag I2C ss status\r\n");
//    ret = bsp_nfc07a1_nfctag_i2cSecuritySessionDyn_get(&i2c_ss_status);
//	if (D_BSP_RET_OK != ret)
//    {
//		printf("Error of bsp_nfc07a1_nfctag_i2cSecuritySessionDyn_get !!!\r\n");
//    }
//    else
//    {
//        printf("NFC tag I2C SS status = %u\r\n", i2c_ss_status);
//    }
//
//    printf("\r\n");
//
//    printf("Present correct password\r\n");
//	nfctag_password_msb = 0;
//	nfctag_password_lsb = 0;
//	ret = bsp_nfc07a1_nfctag_i2cPassword_present(nfctag_password_msb, nfctag_password_lsb);
//	if (D_BSP_RET_OK != ret)
//	{static void c2_init();
//		printf("Error of bsp_nfc07a1_nfctag_i2cPassword_present !!!\r\n");
//	}
//	printf("Check NFC tag I2C ss status\r\n");
//    ret = bsp_nfc07a1_nfctag_i2cSecuritySessionDyn_get(&i2c_ss_status);
//	if (D_BSP_RET_OK != ret)
//    {
//		printf("Error of bsp_nfc07a1_nfctag_i2cSecuritySessionDyn_get !!!\r\n");
//    }
//    else
//    {
//        printf("NFC tag I2C SS status = %u\r\n", i2c_ss_status);
//    }
//
//    printf("\r\n");
//
//    printf("Get User Memory size\r\n");
//    uint32_t blk_num	=	0;
//    uint32_t blk_size	=	0;
//    uint32_t mem_size	=	0;
//    ret = bsp_nfc07a1_nfctag_i2cUsrMemBlockInfo_get(&blk_num, &blk_size);
//    if (D_BSP_RET_OK != ret)
//    {
//    	printf("Error of bsp_nfc07a1_nfctag_i2cUsrMemSize_get !!!\r\n");
//    }
//    else
//    {
//        mem_size = (blk_num + 1) * (blk_size + 1);
//        printf("NFC tag block number = %lu, block size = %lu, memory size = %lu\r\n", blk_num, blk_size, mem_size);
//    }
//
//    ret = bsp_nfc07a1_nfctag_i2cUsrZone_create( (mem_size/4), (mem_size/4), (mem_size/4), (mem_size/4) );
//    if (D_BSP_RET_OK != ret)
//    {
//    	printf("Error of bsp_nfc07a1_nfctag_i2cUsrZone_create !!!\r\n");
//    }
//
//    uint8_t zone_end_add = 0;
//    ret = bsp_nfc07a1_nfctag_i2cUsrZoneEnd_get(E_BSP_NFC07A1_NFCTAG_ZONE_END_1, &zone_end_add);
//	if (D_BSP_RET_OK != ret)
//	{
//		printf("Error of bsp_nfc07a1_nfctag_i2cUsrZoneEnd_get !!!\r\n");
//	}
//	else
//	{
//		printf("Zone 1 end address = %u\r\n", zone_end_add);
//	}
//    ret = bsp_nfc07a1_nfctag_i2cUsrZoneEnd_get(E_BSP_NFC07A1_NFCTAG_ZONE_END_2, &zone_end_add);
//	if (D_BSP_RET_OK != ret)
//	{
//		printf("Error of bsp_nfc07a1_nfctag_i2cUsrZoneEnd_get !!!\r\n");
//	}
//	else
//	{
//		printf("Zone 2 end address = %u\r\n", zone_end_add);
//	}
//    ret = bsp_nfc07a1_nfctag_i2cUsrZoneEnd_get(E_BSP_NFC07A1_NFCTAG_ZONE_END_3, &zone_end_add);
//	if (D_BSP_RET_OK != ret)
//	{
//		printf("ERROR of bsp_nfc07a1_nfctag_i2cUsrZoneEnd_get !!!\r\n");
//	}
//	else
//	{
//		printf("Zone 3 end address = %u\r\n", zone_end_add);
//	}
//
//	ret = bsp_nfc07a1_nfctag_it_configure(D_BSP_NFC07A1_NFCTAG_GPO1_ENABLE_MASK | D_BSP_NFC07A1_NFCTAG_GPO1_FILEDCHQNGE_MASK);
//	if (D_BSP_RET_OK != ret)
//	{
//		printf("ERROR of bsp_nfc07a1_nfctag_it_configure !!!");
//	}
//
//    printf("\r\n");
//
//    printf("Zone 1 is not protected\r\n");
//    ret = bsp_nfc07a1_nfctag_i2cUsrZoneProtect_set(E_BSP_NFC07A1_NFCTAG_PROT_ZONE_1, E_BSP_NFC07a1_NFCTAG_PROT_CONF_NO_PROT);
//    if (D_BSP_RET_OK != ret)
//    {
//        printf("Error of bsp_nfc07a1_nfctag_i2cUsrZoneProtect_set !!!\r\n");
//    }
//
//    printf("Zone 2 is write protected\r\n");
//    ret = bsp_nfc07a1_nfctag_i2cUsrZoneProtect_set(E_BSP_NFC07A1_NFCTAG_PROT_ZONE_2, E_BSP_NFC07A1_NFCTAG_PROT_CONF_WRITE_PROT);
//    if (D_BSP_RET_OK != ret)
//    {
//        printf("Error of bsp_nfc07a1_nfctag_i2cUsrZoneProtect_set !!!\r\n");
//    }
//
//    printf("Zone 3 is read protected\r\n");
//    ret = bsp_nfc07a1_nfctag_i2cUsrZoneProtect_set(E_BSP_NFC07A1_NFCTAG_PROT_ZONE_3, E_BSP_NFC07A1_NFCTAG_PROT_CONF_READ_PROT);
//    if (D_BSP_RET_OK != ret)
//    {
//        printf("Error of bsp_nfc07a1_nfctag_i2cUsrZoneProtect_set !!!\r\n");
//    }
//
//    printf("Zone 4 is read/write protected\r\n");
//    ret = bsp_nfc07a1_nfctag_i2cUsrZoneProtect_set(E_BSP_NFC07A1_NFCTAG_PROT_ZONE_4, E_BSP_NFC07A1_NFCTAG_PROT_CONF_READWRITE_PROT);
//    if (D_BSP_RET_OK != ret)
//    {
//        printf("Error of bsp_nfc07a1_nfctag_i2cUsrZoneProtect_set !!!\r\n");
//    }
//
//    printf("\r\n");
//
//    printf("Read Zone 1 protect configuration\r\n");
//    E_BSP_NFC07A1_NFCTAG_PROT_CONF_T prot_conf = E_BSP_NFC07A1_NFCTAG_PROT_CONF_ERROR;
//    ret = bsp_nfc07a1_nfctag_i2cUsrZoneProtect_get(E_BSP_NFC07A1_NFCTAG_PROT_ZONE_1, &prot_conf);
//    if (D_BSP_RET_OK != ret)
//    {
//    	printf("Error of bsp_nfc07a1_nfctag_i2cUsrZoneProtect_get !!!\r\n");
//    }
//    else
//    {
//    	printf("Protect configuration = %u\r\n", prot_conf);
//    }
//
//    printf("Read Zone 2 protect configuration\r\n");
//    prot_conf = E_BSP_NFC07A1_NFCTAG_PROT_CONF_ERROR;
//    ret = bsp_nfc07a1_nfctag_i2cUsrZoneProtect_get(E_BSP_NFC07A1_NFCTAG_PROT_ZONE_2, &prot_conf);
//    if (D_BSP_RET_OK != ret)
//    {
//    	printf("Error of bsp_nfc07a1_nfctag_i2cUsrZoneProtect_get !!!\r\n");
//    }
//    else
//    {
//    	printf("Protect configuration = %u\r\n", prot_conf);
//    }
//
//    printf("Read Zone 3 protect configuration\r\n");
//    prot_conf = E_BSP_NFC07A1_NFCTAG_PROT_CONF_ERROR;
//    ret = bsp_nfc07a1_nfctag_i2cUsrZoneProtect_get(E_BSP_NFC07A1_NFCTAG_PROT_ZONE_3, &prot_conf);
//    if (D_BSP_RET_OK != ret)
//    {
//    	printf("Error of bsp_nfc07a1_nfctag_i2cUsrZoneProtect_get !!!\r\n");
//    }
//    else
//    {
//    	printf("Protect configuration = %u\r\n", prot_conf);
//    }
//
//    printf("Read Zone 4 protect configuration\r\n");
//    prot_conf = E_BSP_NFC07A1_NFCTAG_PROT_CONF_ERROR;
//    ret = bsp_nfc07a1_nfctag_i2cUsrZoneProtect_get(E_BSP_NFC07A1_NFCTAG_PROT_ZONE_4, &prot_conf);
//    if (D_BSP_RET_OK != ret)
//    {
//    	printf("Error of bsp_nfc07a1_nfctag_i2cUsrZoneProtect_get !!!\r\n");
//    }
//    else
//    {
//    	printf("Protect configuration = %u\r\n", prot_conf);
//    }
//
//    printf("\r\n");
//
//#if 0
//    printf("Present wrong password\r\n");
//	nfctag_password_msb = 123;
//	nfctag_password_lsb = 123;
//	ret = bsp_nfc07a1_nfctag_i2cPassword_present(nfctag_password_msb, nfctag_password_lsb);
//	if (D_BSP_RET_OK != ret)
//	{
//		printf("Error of bsp_nfc07a1_nfctag_i2cPassword_present !!!\r\n");
//	}
//	printf("Check NFC tag I2C ss status\r\n");
//    ret = bsp_nfc07a1_nfctag_i2cSecuritySessionDyn_get(&i2c_ss_status);
//	if (D_BSP_RET_OK != ret)
//    {
//		printf("Error of bsp_nfc07a1_nfctag_i2cSecuritySessionDyn_get !!!\r\n");
//    }
//    else
//    {
//        printf("NFC tag I2C SS status = %u\r\n", i2c_ss_status);
//    }
//#else
//    printf("Present correct password\r\n");
//	nfctag_password_msb = 0;
//	nfctag_password_lsb = 0;
//	ret = bsp_nfc07a1_nfctag_i2cPassword_present(nfctag_password_msb, nfctag_password_lsb);
//	if (D_BSP_RET_OK != ret)
//	{
//		printf("Error of bsp_nfc07a1_nfctag_i2cPassword_present !!!\r\n");
//	}
//	printf("Check NFC tag I2C ss status\r\n");
//    ret = bsp_nfc07a1_nfctag_i2cSecuritySessionDyn_get(&i2c_ss_status);
//	if (D_BSP_RET_OK != ret)
//    {
//		printf("Error of bsp_nfc07a1_nfctag_i2cSecuritySessionDyn_get !!!\r\n");
//    }
//    else
//    {
//        printf("NFC tag I2C SS status = %u\r\n", i2c_ss_status);
//    }
//#endif
//
//    printf("\r\n");
//
//    uint32_t    mem_index       =   0;
//    uint8_t     mem_writeData   =   0xBB;
//    uint8_t     mem_readData    =   0;
//    for(uint8_t cnt = 1; cnt < 5; cnt++)
//    {
//        /* Compute memory index for each zone */
////        mem_index = (((mem_size / 4) + 1) * (cnt - 1));
//    	mem_index = ( (mem_size) / 4 * (cnt - 1) ) + 100;
//
//		printf("Start writing Zone %u, address %lu\r\n", cnt, mem_index);
//		ret = bsp_nfc07a1_nfctag_data_write(&mem_writeData, mem_index, 1);
//		if (D_BSP_RET_OK != ret)
//		{
//			printf("Error of bsp_nfc07a1_nfctag_data_write !!!\r\n");
//		}
//		else
//		{
//			printf("Write Zone %u done\r\n", cnt);
//		}
//
//		printf("Start reading Zone %u\r\n", cnt);
//		ret = bsp_nfc07a1_nfctag_data_read(&mem_readData, mem_index, 1);
//		if (D_BSP_RET_OK != ret)
//		{
//			printf("Error of bsp_nfc07a1_nfctag_data_read !!!\r\n");
//			printf("Memory read data = %u\r\n", mem_readData);
//		}
//		else
//		{
//			printf("Read Zone %u done, read memory data = %d\r\n", cnt, mem_readData);
//		}
//    }

    // uint8_t nfctag_gpo_activeFlag = 0;

    // while(1)
    //  {
    //     bsp_nfc07a1_gpo_activeFlag_check(&nfctag_gpo_activeFlag);

    //     if (nfctag_gpo_activeFlag)
    //     {
    //         bsp_nfc07a1_led_toggle(E_BSP_NFC07A1_LED_GREEN);
    //         bsp_nfc07a1_gpo_activeFlag_reset();
    //     }
    //  }

