veryneo/stm32_cmake_project/app/app_demo/src/app_demo.c
    return 0;
}

extern void shci_notify_asynch_evt(void* pdata)
{
    gs_app_demo_shci_event_pending_flag = E_APP_DEMO_SHCI_EVENT_PENDING_FLAG_SET;
    return;
}

extern void hci_notify_asynch_evt(void* pdata)
{
    gs_app_demo_hci_event_pending_flag = E_APP_DEMO_HCI_EVENT_PENDING_FLAG_SET;
    return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *pckt)
{
    hci_event_pckt *event_pckt;
    // evt_blecore_aci *blecore_evt;
    evt_le_meta_event *le_meta_evt;
    
    event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;

    switch (event_pckt->evt)
    {
        case HCI_LE_META_EVT_CODE:
            le_meta_evt = (evt_le_meta_event *)(event_pckt->data);
            switch (le_meta_evt->subevent)
            {
                case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
                	hci_le_connection_complete_event_rp0* connection_complete_event = (hci_le_connection_complete_event_rp0 *)le_meta_evt->data;
                 	gs_app_demo_ble_conn_handle =	connection_complete_event->Connection_Handle;
                	gs_app_demo_ble_conn_flag 	=	E_APP_DEMO_BLE_CONN_FLAG_SET;
                    printf("BLE connection establish\r\n");
                    break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
                default:
                    break;
            }
            break;
        default:
            break;
    }

    return (SVCCTL_UserEvtFlowEnable);
}

extern int __io_putchar(int ch)
{
    bsp_uart1_tx_send_ch(ch);
    return ch;
}

static void app_demo_cpu2_system_init()
{
    TL_MM_Config_t          tl_mm_conf          =   {0};
    SHCI_TL_HciInitConf_t   shci_tl_init_conf   =   {0};

    /* Initialization of the reference table shared with the CPU2 in SRAM2*/
    TL_Init();

    /* System channel initialization */
    shci_tl_init_conf.p_cmdbuffer       = (uint8_t*)&gs_app_demo_shci_tl_cmd_buf;
    shci_tl_init_conf.StatusNotCallBack = app_demo_shci_tl_status_notification_callback;	
    shci_init(app_demo_shci_user_event_received_callback, (void*)&shci_tl_init_conf);
	  
    /*  Memory Manager channel initialization */
    tl_mm_conf.p_AsynchEvtPool          =   gs_app_demo_tl_mm_evtpool;
    tl_mm_conf.p_BleSpareEvtBuffer      =   gs_app_demo_tl_mm_system_spare_evt_buf;       /* UNUSED, but kept for future compatibility */
    tl_mm_conf.p_SystemSpareEvtBuffer   =   gs_app_demo_tl_mm_ble_spare_evt_buf;    /* UNUSED, but kept for future compatibility, but used by FUS today only */
    tl_mm_conf.AsynchEvtPoolSize        =   D_APP_DEMO_TL_MM_POOL_SIZE;
    TL_MM_Init(&tl_mm_conf);
	  
    /**< Release the CPU2 */
    TL_Enable();
	  
    return;
}

static void app_demo_shci_tl_status_notification_callback(SHCI_TL_CmdStatus_t status)
{
    /* Callback not implemented - code flow under control of the developer */
    (void)status;
    return;
}

static void app_demo_shci_user_event_received_callback(void* pData)
{
    TL_AsynchEvt_t*         p_sys_event;
    SHCI_C2_Ready_Evt_t*    p_sys_ready_event;
    // SCHI_SystemErrCode_t*   p_sys_error_code;
  
    p_sys_event = (TL_AsynchEvt_t*)(((tSHCI_UserEvtRxParam*)pData)->pckt->evtserial.evt.payload);
    
    switch(p_sys_event->subevtcode)
    {
        case SHCI_SUB_EVT_CODE_READY:
            p_sys_ready_event = (SHCI_C2_Ready_Evt_t*)p_sys_event->payload;
            if (p_sys_ready_event->sysevt_ready_rsp == WIRELESS_FW_RUNNING)
            {
                printf("CPU2 run wireless stack\r\n");
                gs_app_demo_cpu2_run_status = E_APP_DEMO_CPU2_RUN_STATUS_WIRELESS;
            }
            else if (p_sys_ready_event->sysevt_ready_rsp == FUS_FW_RUNNING)
            {
                printf("CPU2 run fus\r\n");
                gs_app_demo_cpu2_run_status = E_APP_DEMO_CPU2_RUN_STATUS_FUS;
            }
            break; /* SHCI_SUB_EVT_CODE_READY */
        case SHCI_SUB_EVT_ERROR_NOTIF:
            printf("CPU2 system error\r\n");
            gs_app_demo_cpu2_err_flag = 1;
            break; /* SHCI_SUB_EVT_ERROR_NOTIF */
        default:
            break;
    }
    
    // ((tSHCI_UserEvtRxParam *)pData)->status = SHCI_TL_UserEventFlow_Disable;
    
    return;
}

static void app_demo_ble_init()
{
    SHCI_CmdStatus_t ret;
  
    SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
    {
        {{0,0,0}},                          /**< Header unused */
        {0,                                 /** pBleBufferAddress not used */
        0,                                  /** BleBufferSize not used */
        CFG_BLE_NUM_GATT_ATTRIBUTES,
        CFG_BLE_NUM_GATT_SERVICES,
        CFG_BLE_ATT_VALUE_ARRAY_SIZE,
        CFG_BLE_NUM_LINK,
        CFG_BLE_DATA_LENGTH_EXTENSION,
        CFG_BLE_PREPARE_WRITE_LIST_SIZE,
        CFG_BLE_MBLOCK_COUNT,
        CFG_BLE_MAX_ATT_MTU,
        CFG_BLE_PERIPHERAL_SCA,
        CFG_BLE_CENTRAL_SCA,
        CFG_BLE_LS_SOURCE,
        CFG_BLE_MAX_CONN_EVENT_LENGTH,
        CFG_BLE_HSE_STARTUP_TIME,
        CFG_BLE_VITERBI_MODE,
        CFG_BLE_OPTIONS,
        0,
        CFG_BLE_MAX_COC_INITIATOR_NBR,
        CFG_BLE_MIN_TX_POWER,
        CFG_BLE_MAX_TX_POWER,
        CFG_BLE_RX_MODEL_CONFIG,
        CFG_BLE_MAX_ADV_SET_NBR, 
        CFG_BLE_MAX_ADV_DATA_LEN,
        CFG_BLE_TX_PATH_COMPENS,
        CFG_BLE_RX_PATH_COMPENS,
        CFG_BLE_CORE_VERSION,
        CFG_BLE_OPTIONS_EXT
        }
    };

    /* BLE channel initialization */
    app_demo_ble_tl_init();

    /* Starts the BLE Stack on CPU2 */
    ret = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
    if (ret != SHCI_Success)
    {
        printf("Start BLE stack error\r\n");
    }

    app_demo_ble_gap_gatt_init();
    
}

static void app_demo_ble_tl_init()
{
    HCI_TL_HciInitConf_t hci_tl_init_conf;

    hci_tl_init_conf.p_cmdbuffer = (uint8_t*)&gs_app_demo_hci_tl_cmd_buffer;
    hci_tl_init_conf.StatusNotCallBack = app_demo_hci_tl_status_notification_callback;
    hci_init(app_demo_hci_user_event_receive_callback, (void*) &hci_tl_init_conf);
}

static void app_demo_ble_gap_gatt_init()
{
    uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
    const uint8_t *bd_address;
    uint32_t srd_bd_address[2];
    tBleStatus ret = BLE_STATUS_SUCCESS;
    
