veryneo/stm32_cmake_project/app/app_demo/src/app_demo.c
    /* BLE HCI Reset to synchronize BLE Stack */
    hci_reset();

    /* Write the BD Address */
    bd_address = app_demo_ble_bdaddress_get();
    aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET, CONFIG_DATA_PUBADDR_LEN, (uint8_t*) bd_address);
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("Set bd address err\r\n");
    }

    /** 
     * Static random Address
     * The two upper bits shall be set to 1
     * The lowest 32bits is read from the UDN to differentiate between devices
     * The RNG may be used to provide a random number on each power on
     */
    srd_bd_address[1]   =   0x0000ED6E;
    srd_bd_address[0]   =   LL_FLASH_GetUDN( );
    ret = aci_hal_write_config_data(CONFIG_DATA_RANDOM_ADDRESS_OFFSET, CONFIG_DATA_RANDOM_ADDRESS_LEN, (uint8_t*)srd_bd_address);
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("Set random bd ddress err\r\n");
    }

    /*  Set TX Power */
    ret = aci_hal_set_tx_power_level(0, CFG_TX_POWER);
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("Set TX power err\r\n");
    }

    /* Set Radio activity event mask */
    ret = aci_hal_set_radio_activity_mask(CFG_RADIO_ACTIVITY_EVENT_MASK);
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("Set radio activity event mask err\r\n");
    }

    /* Initialize GATT */
    ret = aci_gatt_init();
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("GATT init err\r\n");
    }

    /*  Initialize GAP */
    ret = aci_gap_init(
            GAP_PERIPHERAL_ROLE,
            PRIVACY_DISABLED,
            D_APP_DEMO_BLE_GAP_DEVICE_NAME_LEN,
            &gap_service_handle,
            &gap_dev_name_char_handle,
            &gap_appearance_char_handle
        );
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("GAP init err\r\n");
    }

    /* Update GAP Service Device Name characteristic value */
    ret = aci_gatt_update_char_value(
            gap_service_handle,
            gap_dev_name_char_handle,
            0,
            D_APP_DEMO_BLE_GAP_DEVICE_NAME_LEN,
            (uint8_t *)gs_app_demo_ble_gap_device_name
        );
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("GAP device name char value update err\r\n");
    }

    /* Update GAP Service Appearance characteristic value */
    ret = aci_gatt_update_char_value(
            gap_service_handle,
            gap_appearance_char_handle,
            0,
            sizeof(gs_app_demo_ble_gap_appearance),
            (uint8_t *)&gs_app_demo_ble_gap_appearance
        );
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("GAP appearance char value err\r\n");
    }

    return;
}

static const uint8_t* app_demo_ble_bdaddress_get()
{
    uint8_t *p_otp_addr;
    const uint8_t *p_bd_addr;
    uint32_t udn;
    uint32_t company_id;
    uint32_t device_id;
  
    udn = LL_FLASH_GetUDN();
  
    if (udn != 0xFFFFFFFF)
    {
        company_id = LL_FLASH_GetSTCompanyID();
        device_id = LL_FLASH_GetDeviceID();
  
        /**
        * Public Address with the ST company ID
        * bit[47:24] : 24bits (OUI) equal to the company ID
        * bit[23:16] : Device ID.
        * bit[15:0] : The last 16bits from the UDN
        * Note: In order to use the Public Address in a final product, a dedicated
        * 24bits company ID (OUI) shall be bought.
        */
        bd_address_udn[0] = (uint8_t)(udn & 0x000000FF);
        bd_address_udn[1] = (uint8_t)((udn & 0x0000FF00) >> 8);
        bd_address_udn[2] = (uint8_t)device_id;
        bd_address_udn[3] = (uint8_t)(company_id & 0x000000FF);
        bd_address_udn[4] = (uint8_t)((company_id & 0x0000FF00) >> 8);
        bd_address_udn[5] = (uint8_t)((company_id & 0x00FF0000) >> 16);

        (void)gs_app_demo_nfctag_ble_bd_addr;
		char *ptr = (char*)gs_app_demo_nfctag_ble_bd_addr;
		for (int8_t i = 5; i >= 0; --i)
		{
			if (i < 5)
			{
				*ptr++ = ':'; 	// 非首元素前添加冒号
			}
			snprintf(ptr, 3, "%02X", bd_address_udn[i]);
			ptr += 2; 			// 移动指针到下一个位置
		}
		*ptr = '\0';

        p_bd_addr = (const uint8_t *)bd_address_udn;
    }
    else
    {
        p_otp_addr = OTP_Read(0);
        if (p_otp_addr)
        {
            p_bd_addr = ((OTP_ID0_t*)p_otp_addr)->bd_address;
        }
        else
        {
            p_bd_addr = a_MBdAddr;
        }
    }
  
    return p_bd_addr;
}

static void app_demo_hci_tl_status_notification_callback(HCI_TL_CmdStatus_t status)
{
    /* Callback not implemented - code flow under control of the developer */
    (void)status;
    return;
}

static void app_demo_hci_user_event_receive_callback(void * pData)
{
    SVCCTL_UserEvtFlowStatus_t svctl_return_status;
    tHCI_UserEvtRxParam *pParam;
    
    pParam = (tHCI_UserEvtRxParam *)pData; 
    
    svctl_return_status = SVCCTL_UserEvtRx((void *)&(pParam->pckt->evtserial));
    if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
    {
        pParam->status = HCI_TL_UserEventFlow_Enable;
    }
    else
    {
        pParam->status = HCI_TL_UserEventFlow_Disable;
    }
}

static void app_demo_ble_custom_service_init()
{
    tBleStatus ret = BLE_STATUS_SUCCESS;
    Char_UUID_t uuid16;
    
    /* Register the event handler to the BLE controller */
    SVCCTL_RegisterSvcHandler(app_demo_ble_custom_service_event_handler);
    
    /*  Add My Very Own Service */
    D_APP_DEMO_COPY_BLE_CUSTOM_SERVICE_UUID(uuid16.Char_UUID_128);
    ret = aci_gatt_add_service(
            UUID_TYPE_128,
            (Service_UUID_t*)&uuid16,
            PRIMARY_SERVICE,
            D_APP_DEMO_BLE_CUSTOM_SERVICE_MAX_ATT_RECORDS,
            &(gs_app_demo_ble_custom_service_ctx.service_handle)
        );
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("ADD custom service err\r\n");
    }
    
    /* Add My Very Own Write Characteristic */
    D_APP_DEMO_COPY_BLE_CUSTOM_WRITE_CHAR_UUID(uuid16.Char_UUID_128);
    ret = aci_gatt_add_char(
            gs_app_demo_ble_custom_service_ctx.service_handle,
            UUID_TYPE_128, &uuid16,
            D_APP_DEMO_BLE_CUSTOM_SERVICE_WRTIE_CHAR_VALUE_LEN,                                   
            CHAR_PROP_WRITE_WITHOUT_RESP|CHAR_PROP_READ,
            ATTR_PERMISSION_NONE,
            GATT_NOTIFY_ATTRIBUTE_WRITE, /* gattEvtMask */
            10, /* encryKeySize */
            1, /* isVariable */
            &(gs_app_demo_ble_custom_service_ctx.write_char_handle)
        );
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("ADD custom service write char err\r\n");
    }
    
    /* Add My Very Own Notify Characteristic */
    D_APP_DEMO_COPY_BLE_CUSTOM_NOTIFY_CHAR_UUID(uuid16.Char_UUID_128);
    ret = aci_gatt_add_char(
            gs_app_demo_ble_custom_service_ctx.service_handle,
            UUID_TYPE_128, &uuid16,
            D_APP_DEMO_BLE_CUSTOM_SERVICE_NOTIFY_CHAR_VALUE_LEN,
            CHAR_PROP_NOTIFY,
            ATTR_PERMISSION_NONE,
            GATT_NOTIFY_ATTRIBUTE_WRITE, /* gattEvtMask */
            10, /* encryKeySize */
            1, /* isVariable: 1 */
            &(gs_app_demo_ble_custom_service_ctx.notify_char_handle)
        );
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("ADD custom service notify char err\r\n");
    }
    
    return;
}

// static tBleStatus app_demo_ble_custom_service_char_value_update(uint16_t uuid, uint16_t new_value_len, uint8_t* p_new_value)
// {
//     tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
//     switch(uuid)
//     {
//         case D_APP_DEMO_BLE_CUSTOM_NOTIFY_CHARA_UUID:
//             if (new_value_len <= D_APP_DEMO_BLE_CUSTOM_SERVICE_NOTIFY_CHAR_VALUE_LEN)
//             {
//                 ret = aci_gatt_update_char_value(
//                         gs_app_demo_ble_custom_service_ctx.service_handle,
//                         gs_app_demo_ble_custom_service_ctx.notify_char_handle,
//                         0,
//                         new_value_len,
//                         p_new_value
//                     );
//                 // ret = aci_gatt_update_char_value(
//                 //         myVeryOwnServiceContext.MyVeryOwnServiceHandle,
//                 //         myVeryOwnServiceContext.MyVeryOwnNotifyCharacteristicHandle,
//                 //         0, /* charValOffset */
//                 //         newValueLength, /* charValueLen */
//                 //         (uint8_t *) pNewValue
//                 //     );
//             }
//             break;
//         default:
//             break;
//     }
    
//     return ret;
// }

static SVCCTL_EvtAckStatus_t app_demo_ble_custom_service_event_handler(void* event)
{
    SVCCTL_EvtAckStatus_t   return_value;
    hci_event_pckt*         event_pckt;
    evt_blecore_aci*        blecore_evt;
    aci_gatt_attribute_modified_event_rp0 *attribute_modified;
    
    return_value = SVCCTL_EvtNotAck;
    event_pckt = (hci_event_pckt *)(((hci_uart_pckt*)event)->data);
    
    switch(event_pckt->evt)
    {
        case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
        {
            blecore_evt = (evt_blecore_aci*)event_pckt->data;
            switch(blecore_evt->ecode)
            {
                case ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE:
                    attribute_modified = (aci_gatt_attribute_modified_event_rp0*)blecore_evt->data;
                    if(attribute_modified->Attr_Handle == (gs_app_demo_ble_custom_service_ctx.write_char_handle + D_APP_DEMO_BLE_CUSTOM_SERVICE_CHAR_VALUE_ATTR_OFFSET))
                    {
                        if (attribute_modified->Attr_Data[1] == 0x01)
                        {

