veryneo/stm32_cmake_project/app/app_demo/src/app_demo.c
                        }
                        else 
                        {

                        }
                    }
          
                    break;
                default:
                    break;
            }
        }
        
        break; /* HCI_HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE_SPECIFIC */
    default:
        break;
    }

    return return_value;
}

static void app_demo_ble_advertising_start()
{
    tBleStatus ret = BLE_STATUS_SUCCESS;

    ret = aci_gap_set_discoverable(
        ADV_IND,                                        /*< Advertise as connectable, undirected. */
        D_APP_DEMO_BLE_FAST_CONN_ADV_INTERVAL_MIN,      /*< Set the advertising interval min value. */
        D_APP_DEMO_BLE_FAST_CONN_ADV_INTERVAL_MAX,      /*< Set the advertising interval max value. */
        GAP_PUBLIC_ADDR,                                /*< Use the public address. */
        NO_WHITE_LIST_USE,                             /*< No white list. */
        sizeof(gs_app_demo_ble_ad_local_name), (uint8_t*)gs_app_demo_ble_ad_local_name,/*< Use a local name. */
        0, NULL,                                       /*< Do not include the service UUID list. (no adopted services) */
        0x0000, 0x0000);                               /*< NaN, do not put in advertising data. */
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("Set BLE discoverable err\r\n");
    }

    ret = aci_gap_update_adv_data(sizeof(gs_app_demo_ble_ad_manufacturer_specific_data), (uint8_t*)gs_app_demo_ble_ad_manufacturer_specific_data);
    if (ret != BLE_STATUS_SUCCESS)
    {
        printf("Update adv data err\r\n");
    }

    printf("BLE advertisement start\r\n");

}

static void app_demo_ble_advertising_stop()
{
	tBleStatus ret = BLE_STATUS_SUCCESS;

	ret = aci_gap_set_non_discoverable();
	if (ret != BLE_STATUS_SUCCESS)
	{
		printf("Set BLE non discoverable err\r\n");
	}

	printf("BLE advertisement stop\r\n");
}

static void app_demo_ble_conn_disconnect()
{
	tBleStatus ret = BLE_STATUS_SUCCESS;

	uint8_t disconnect_reason = 0x13;

	ret = aci_gap_terminate(gs_app_demo_ble_conn_handle, disconnect_reason);
	if (ret != BLE_STATUS_SUCCESS)
	{
		printf("Terminate BLE connection err\r\n");
	}

	printf("BLE connection terminate\r\n");
}

static void app_demo_ble_stack_reset()
{
	tBleStatus  ret = BLE_STATUS_SUCCESS;

	ret = aci_hal_stack_reset();
	if (ret != BLE_STATUS_SUCCESS)
	{
		printf("BLE stack reset err\r\n");
	}
}

static void app_demo_lowpower_sw_callback()
{
	ga_app_demo_lowpower_enter_flag = E_APP_DEMO_LOWPOWER_ENTER_FLAG_SET;
}
